Revit 2024 API
ParameterTypeId.EnergyAnalysisHvacSystem Property
 "HVAC System"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId EnergyAnalysisHvacSystem { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisHvacSystem As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisHvacSystem {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace